-- contact_tbl 테이블 데이터 insert
INSERT INTO mjc_db.contact_tbl
	(id, name, phoneNumber, zipNumber, email, addr)
VALUES
	(1, 'abc', '010-1111-1111', '12345', 'abc@naver.com', '서울특별시 마포구 월드컵북로 396')
	, (2, 'abc2', '010-2222-2222', '12345', 'abc2@naver.com', '부산광역시 해운대구 센텀중앙로 97')
	, (3, 'abc3', '010-3333-3333', '12345', 'abc3@naver.com', '대구광역시 수성구 동대구로 345')
	, (4, 'abc4', '010-4444-4444', '12345', 'abc4@naver.com', '인천광역시 연수구 송도미래로 30')
	, (5, 'abc5', '010-5555-5555', '12345', 'abc5@naver.com', '경기도 성남시 분당구 황새울로 200')
	, (6, 'abc6', '010-6666-6666', '12345', 'abc6@naver.com', '강원도 춘천시 중앙로 55')
	, (7, 'abc7', '010-7777-7777', '12345', 'abc7@naver.com', '충청남도 천안시 서북구 불당34길 15');

-- learn_tbl 테이블 데이터 insert
INSERT INTO 
	mjc_db.learn_tbl (lecture_id,score,contact_id) 
VALUES 
	(1,80.1,1),	 (2,82.2,2), (3,90.3,3), (4,85.4,4), (5,61.5,5), (6,77.6,6), (7,19.7,7);

-- lecture_tbl 테이블 데이터 insert
INSERT INTO mjc_db.lecture_tbl
	(id, subject, teacher, room_num, start_dt, end_dt)
VALUES
	(1, '데이터 통신', '김교수', '1반', '2025-03-02', '2025-06-27');
	, (2, '객체지향언어', '오교수', '2반', '2025-03-02', '2025-06-22');
	, (3, 'HTML', '이교수', '3반', '2025-03-03', '2025-06-23');
	, (4, 'mysql', '정교수', '4반', '2025-03-04', '2025-06-24');
	, (5, 'spring', '임교수', '5반', '2025-03-05', '2025-06-25');
	, (6, 'android', '조교수', '6반', '2025-03-06', '2025-06-26');
	, (7, 'arduino', '유교수', '7반', '2025-03-07', '2025-06-27');

-- location_tbl 테이블 데이터 insert
INSERT INTO mjc_db.location_tbl
	(id, location)
VALUES
	(1, '서울특별시');
	, (2, '부산광역시');
	, (3, '대구광역시');
	, (4, '인천광역시');
	, (5, '경기도');
	, (6, '강원도');
	, (7, '충청남도');

-- saled_tbl 테이블 데이터 insert
INSERT INTO mjc_db.saled_tbl
	(id, sale_dt, price, qty, product, location_id, discount, contact_id)
VALUES
	(1, '2025-07-03', 4000, 5, '참치캔', 1, 1000, 1);
	, (2, '2025-07-03', 5000, 2, '식빵', 2, 0, 2);
	, (3, '2025-07-03', 2500, 10, '과자', 3, 500, 3);
	, (4, '2025-07-03', 8000, 1, '세제', 4, 1500, 4);
	, (5, '2025-07-03', 10000, 1, '애완동물 사료', 5, 800, 5);
	, (6, '2025-07-03', 15000, 1, '쌀', 6, 1000, 6);
	, (7, '2025-07-03', 1000, 5, '아이스크림', 7, 200, 7);
